Autodesk.Revit.DB.StructuralAssetClass
Since:
2013
Represents the type of material described by a structural asset.  This enum value is returned by Autodesk::Revit::DB::StructuralAsset::StructuralAssetClass.
Since:
2013

Autodesk.Revit.DB.StructuralAssetClass.Plastic
Structural asset class is plastic.

Autodesk.Revit.DB.StructuralAssetClass.Gas
Structural asset class is gas.

Autodesk.Revit.DB.StructuralAssetClass.Liquid
Structural asset class is liquid.

Autodesk.Revit.DB.StructuralAssetClass.Wood
Structural asset class is wood.

Autodesk.Revit.DB.StructuralAssetClass.Concrete
Structural asset class is concrete.

Autodesk.Revit.DB.StructuralAssetClass.Metal
Structural asset class is metal.

Autodesk.Revit.DB.StructuralAssetClass.Generic
Structural asset class is generic.

Autodesk.Revit.DB.StructuralAssetClass.Basic
Structural asset class is basic.

Autodesk.Revit.DB.StructuralAssetClass.Undefined
Structural asset class is undefined.